In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
mylist = [10,20,30]
arr = np.array(mylist)

In [3]:
pd.Series(data=mylist)

0    10
1    20
2    30
dtype: int64

In [4]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int32

In [5]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [6]:
ser1 = pd.Series(data=[1,2,3,4], index=['a','b','c','d'])

In [7]:
ser1['b']

2

In [8]:
ser2 = pd.Series(data=[1,3,4,5], index=['a','c','d','e'])

In [9]:
ser1 + ser2

a    2.0
b    NaN
c    6.0
d    8.0
e    NaN
dtype: float64

## Dataframes

In [10]:
np.random.seed(111)

rand_mat = np.random.randn(5,4)

In [11]:
rand_mat

array([[-1.13383833,  0.38431919,  1.49655378, -0.3553823 ],
       [-0.78753354, -0.45943891, -0.05916877, -0.3541735 ],
       [-0.73552305, -1.18393989,  0.23889413, -0.58992026],
       [-1.44058512,  0.77370311, -1.02796733, -0.09098625],
       [ 0.492003  ,  0.4246722 ,  1.28304882,  0.31598645]])

In [12]:
df = pd.DataFrame(data=rand_mat,index='A B C D E'.split(), columns='W X Y Z'.split())

In [13]:
df

          W         X         Y         Z
A -1.133838  0.384319  1.496554 -0.355382
B -0.787534 -0.459439 -0.059169 -0.354174
C -0.735523 -1.183940  0.238894 -0.589920
D -1.440585  0.773703 -1.027967 -0.090986
E  0.492003  0.424672  1.283049  0.315986

In [14]:
df['W']

A   -1.133838
B   -0.787534
C   -0.735523
D   -1.440585
E    0.492003
Name: W, dtype: float64

In [15]:
df.W

A   -1.133838
B   -0.787534
C   -0.735523
D   -1.440585
E    0.492003
Name: W, dtype: float64

In [16]:
cols = ['W', 'Y']
df[cols]

          W         Y
A -1.133838  1.496554
B -0.787534 -0.059169
C -0.735523  0.238894
D -1.440585 -1.027967
E  0.492003  1.283049

In [17]:
df['N'] = df['W'] + df['Y']
df

          W         X         Y         Z         N
A -1.133838  0.384319  1.496554 -0.355382  0.362715
B -0.787534 -0.459439 -0.059169 -0.354174 -0.846702
C -0.735523 -1.183940  0.238894 -0.589920 -0.496629
D -1.440585  0.773703 -1.027967 -0.090986 -2.468552
E  0.492003  0.424672  1.283049  0.315986  1.775052

In [18]:
df.drop('N', axis=1, inplace=True)

In [19]:
df.loc[['A','C']]

          W         X         Y         Z
A -1.133838  0.384319  1.496554 -0.355382
C -0.735523 -1.183940  0.238894 -0.589920

In [20]:
df.loc[['A','C'], ['Y', 'Z']]

          Y         Z
A  1.496554 -0.355382
C  0.238894 -0.589920

In [21]:
df.iloc[[2,3]]

          W         X         Y         Z
C -0.735523 -1.183940  0.238894 -0.589920
D -1.440585  0.773703 -1.027967 -0.090986

In [22]:
df_bool = df > 0
df_bool

       W      X      Y      Z
A  False   True   True  False
B  False  False  False  False
C  False  False   True  False
D  False   True  False  False
E   True   True   True   True

In [23]:
df[df > 0]

          W         X         Y         Z
A       NaN  0.384319  1.496554       NaN
B       NaN       NaN       NaN       NaN
C       NaN       NaN  0.238894       NaN
D       NaN  0.773703       NaN       NaN
E  0.492003  0.424672  1.283049  0.315986

In [24]:
df[df['W'] >0]

          W         X         Y         Z
E  0.492003  0.424672  1.283049  0.315986

In [25]:
cond1=df['W']>0
cond2=df['Y']>1
df[cond1 & cond2]

          W         X         Y         Z
E  0.492003  0.424672  1.283049  0.315986

In [26]:
df.reset_index()

  index         W         X         Y         Z
0     A -1.133838  0.384319  1.496554 -0.355382
1     B -0.787534 -0.459439 -0.059169 -0.354174
2     C -0.735523 -1.183940  0.238894 -0.589920
3     D -1.440585  0.773703 -1.027967 -0.090986
4     E  0.492003  0.424672  1.283049  0.315986

In [27]:
new_idx = 'CA NY WY QR CO'.split()

In [28]:
df['States'] = new_idx
df

          W         X         Y         Z States
A -1.133838  0.384319  1.496554 -0.355382     CA
B -0.787534 -0.459439 -0.059169 -0.354174     NY
C -0.735523 -1.183940  0.238894 -0.589920     WY
D -1.440585  0.773703 -1.027967 -0.090986     QR
E  0.492003  0.424672  1.283049  0.315986     CO

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   W       5 non-null      float64
 1   X       5 non-null      float64
 2   Y       5 non-null      float64
 3   Z       5 non-null      float64
 4   States  5 non-null      object
dtypes: float64(4), object(1)
memory usage: 412.0+ bytes

In [30]:
df.dtypes

W         float64
X         float64
Y         float64
Z         float64
States     object
dtype: object

In [31]:
df.describe()

              W         X         Y         Z
count  5.000000  5.000000  5.000000  5.000000
mean  -0.721095 -0.012137  0.386272 -0.214895
std    0.735570  0.796669  1.031642  0.345314
min   -1.440585 -1.183940 -1.027967 -0.589920
25%   -1.133838 -0.459439 -0.059169 -0.355382
50%   -0.787534  0.384319  0.238894 -0.354174
75%   -0.735523  0.424672  1.283049 -0.090986
max    0.492003  0.773703  1.496554  0.315986

In [32]:
ser_w = df['W'] > 0

In [33]:
ser_w.value_counts()

W
False    4
True     1
Name: count, dtype: int64

In [34]:
sum(ser_w)

1

In [35]:
len(ser_w)

5

## Mssing Data

In [36]:
df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'C': [1,2,3]})
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [38]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [39]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [40]:
df.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [41]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [42]:
df.fillna(df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## GroupBy

In [43]:
data = {'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
        'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Saral'],
        'Sales': [200,120,340,124,243,350]}

In [44]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Saral    350

In [45]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

## Operations

In [46]:
df = pd.DataFrame({'col1': [1,2,3,4], 'col2': [44,33,44,55], 'col3': ['aaa','bbb','ccc','ddd']})
df.head()

   col1  col2 col3
0     1    44  aaa
1     2    33  bbb
2     3    44  ccc
3     4    55  ddd

In [47]:
df['col2'].unique()

array([44, 33, 55], dtype=int64)

In [48]:
df['col2'].nunique()

3

In [49]:
df['col2'].value_counts()

col2
44    2
33    1
55    1
Name: count, dtype: int64

In [50]:
newdf = df[(df['col1'] > 2) & (df['col2'] == 44)]
newdf

   col1  col2 col3
2     3    44  ccc

In [51]:
def times_two(number):
    return number*2

In [52]:
times_two(4)

8

In [53]:
df['new'] = df['col1'].apply(times_two)
df

   col1  col2 col3  new
0     1    44  aaa    2
1     2    33  bbb    4
2     3    44  ccc    6
3     4    55  ddd    8

In [54]:
df.columns

Index(['col1', 'col2', 'col3', 'new'], dtype='object')

In [55]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   col1    4 non-null      int64
 1   col2    4 non-null      int64
 2   col3    4 non-null      object
 3   new     4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes

In [57]:
df.describe()

           col1       col2       new
count  4.000000   4.000000  4.000000
mean   2.500000  44.000000  5.000000
std    1.290994   8.981462  2.581989
min    1.000000  33.000000  2.000000
25%    1.750000  41.250000  3.500000
50%    2.500000  44.000000  5.000000
75%    3.250000  46.750000  6.500000
max    4.000000  55.000000  8.000000

In [58]:
df.sort_values('col2', ascending=False)

   col1  col2 col3  new
3     4    55  ddd    8
0     1    44  aaa    2
2     3    44  ccc    6
1     2    33  bbb    4

## Input / Output

In [59]:
pwd

'd:\\workspace\\Coding\\udemy\\time series'

In [60]:
df = pd.read_csv('example.csv')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [61]:
newdf = df[['a','b']]
newdf

    a   b
0   0   1
1   4   5
2   8   9
3  12  13

In [62]:
newdf.to_csv('mynew.csv', index=True)

In [63]:
pd.read_excel('Excel_Sample.xlsx', sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [64]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [65]:
df.loc[:, ~df.columns.str.contains('^Unnamed')]

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [66]:
my_list_tables = pd.read_html('https://www.fdic.gov/resources/resolutions/bank-failures/failed-bank-list/')

In [67]:
type(my_list_tables)

list

In [68]:
len(my_list_tables)

1

In [70]:
df = my_list_tables[0]
df

,Bank NameBank,CityCity,StateSt,CertCert,Acquiring InstitutionAI,Closing DateClosing,FundFund
0,Signature Bank,New York,NY,57053,"Flagstar Bank, N.A.","March 12, 2023",10540
1,Silicon Valley Bank,Santa Clara,CA,24735,First–Citizens Bank & Trust Company,"March 10, 2023",10539
2,Almena State Bank,Almena,KS,15426,Equity Bank,"October 23, 2020",10538
3,First City Bank of Florida,Fort Walton Beach,FL,16748,"United Fidelity Bank, fsb","October 16, 2020",10537
4,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020",10536
...,...,...,...,...,...,...,...
560,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001",6004
561,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001",4648
562,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001",4647
563,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000",4646
564,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000",4645